public class zadanie3_4_1 {
    // 3. Составьте программу, которая переводит переменную из int в long
    public static void main(String[] args) {
        // инфо здесь: https://habr.com/ru/post/225901/
        //byte x = 10; //8 bit
        //short у = 10; //16 bit
        //int z = 10; //32 bit
        //long q = 10L; //64 bit

        System.out.println("Ответ на Задание 3: Специальная программа не требуется, т.к. тип переменных long по размеру\n памяти больше, нежели int (64 bit против 32 bit), т.е. 'сильнее' или 'мощнее', поэтому преобразование происходит автоматически,\n т.н. 'неявным'способом /В отличии от задачи, когда нужно наоборот перевести/.");
    }
}